Revit 2027 API
Document.GetSpaceAtPoint(XYZ, Phase) Method
Gets a space containing the point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Space GetSpaceAtPoint(
	XYZ point,
	Phase phase
)
Public Function GetSpaceAtPoint (
	point As XYZ,
	phase As Phase
) As Space
public:
Space^ GetSpaceAtPoint(
	XYZ^ point,
	Phase^ phase
)
member GetSpaceAtPoint :
        point : XYZ *
        phase : Phase -> Space
Parameters
point XYZ
Point to be checked.
phase Phase
Phase in which the space exists.
Return Value
Space
The space containing the point.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the point is null.
ArgumentException |  Thrown when the coordinates of the point are not number or are Double::MaxValue or Double::MinValue.
Remarks
If phase is null, it will get the space of the last phase.The first one found will be returned. If there is no space containing the point, it returns null.
See Also
Reference
Document Class
GetSpaceAtPoint Overload
Autodesk.Revit.DB Namespace